% 1. 矩阵分解
% 三角分解      [l, u] = lu(A) 
%               针对方阵， l：下三角阵， u：上三角阵
% 正交分解      [q, r] = qr(A)
%               设A为n*m矩阵
%               q:n阶正交方阵，r:与a同阶的上三角矩阵
% 奇异值分解    [u, s, v] = svd(A)
%               设A为n*m矩阵
%               u:n阶正交方阵
%               s:n*m阶对角阵，对角线元素为a的奇异值，长度为min(n, m)
%               v:m阶正交方阵



% 2. 矩阵变换
% 共轭转置    '
% 共轭        conj
% 转置        conj'
% 例2.4-3
z = [1+2i, 3+4i; 5+6i, 7+8i]
z1 = z'
z2 = conj(z)
z3 = conj(z')


% 矩阵行、列扩展
% 例2.4-4
a = [1,2,3; 4,5,6; 7,8,9]
% 行扩展
a(4,3) = 6.5
a(5, :) = [5, 4, 3]
% 列扩展
a(:, 4) = [5; 4; 3; 2; 1]



